#"ตากผ้าดีมั้ย" あめふり (Amefuri)

# * Restrict Word: sort sorted sum {} list append [] join remove dict set pop split tuple lambda match case

# เป็นโปรเจคของนักศึกษากลุ่มหนึ่งที่ต้องการสร้างเว็บไซต์ที่ช่วยให้ตัดสินใจว่า "จะซักผ้าดีมั้ยนะ?" ได้ง่ายขึ้นด้วยการนำเสนอข้อมูลสภาพอากาศในช่วง 8 ชั่วโมงถัดไปเพื่อให้ผู้ใช้ได้พิจารณาว่า "ตากผ้าไปแล้วมันจะแห้งมั้ยนะ?"

#        ในคราวนี้หนึ่งในนักศึกษาในกลุ่มนั้นที่ชื่อขึ้นต้นด้วย ฟัน ลงท้ายด้วย ครูส ต้องการจะพัฒนาโปรเจคนี้ต่อเป็น Amefuri Plus แต่ด้วยความที่เขาติดงานอื่นมากมาย เขาจึงมาติดต่อให้คุณช่วยพัฒนาระบบคำนวณว่าผ้าแห้งหรือยังให้กับเขา

# โดยในการคำนวณค่าความเปียกของผ้าจะมีค่าความเปียกเริ่มต้นที่ 8 (หลังจากซักเสร็จ) และจะเก็บผ้าเมื่อค่าความเปียกเป็น 0 หรือต่ำกว่า (ผ้าแห้ง) หรือในสถานการณ์ที่ผ้าเปียกเพิ่มมากขึ้นค่าความเปียกจะไม่เกิน 16 (เปียกโฉก)

# ในการพิจารณาการเปลี่ยนแปลงของค่าความเปียก จะพิจารณาจากสภาพอากาศรายชั่วโมงที่ตากผ้า และช่วงเวลา (กลางวัน - กลางคืน) ที่กำลังตากอยู่

# โดยพี่ครูสจะส่งข้อมูลเข้ามา 2 อย่างคือ

# H ชั่วโมงเป็นจำนวนเต็ม
# log สภาพอากาศรายชั่วโมงเป็น String โดยเทียบ 1 ตัวอักษรต่อ 1 ชั่วโมง

# โดยสภาพอากาศที่แต่ละตัวอักษรสื่อถึง และการเปลี่ยนแปลงค่าความเปียกของการตากผ้าในสภาพอากาศนั้นๆ จะสามารถอ้างอิงได้จากตารางต่อไปนี้

# ในช่วงกลางวัน (6 <= H < 18)

# สภาพอากาศ	การเปลี่ยนแปลงของค่าความเปียก (ต่อชั่วโมง)
# Cloudy (C, c)	ลดค่าความเปียก 0.50
# Normal (N, n)	ลดค่าความเปียก 1.00
# Windy (W, w)	ลดค่าความเปียก 1.50
# ในช่วงกลางคืน (0 <= H < 6 and 18 <= H <= 24)
# ค่าความเปียกลดน้อยกว่าช่วงเช้าเพราะไม่มีแสงแดด

# สภาพอากาศ	การเปลี่ยนแปลงของค่าความเปียก (ต่อชั่วโมง)
# Cloudy (C, c)	ลดค่าความเปียก 0.25
# Normal (N, n)	ลดค่าความเปียก 0.50
# Windy (W, w)	ลดค่าความเปียก 0.75
# แต่ว่าในการตากผ้าครั้งนี้จะไม่เก็บผ้าเข้ามาถ้าผ้ายังไม่แห้ง (ค่าความเปียกเป็น 0) ทำให้ในสถานการณ์ที่เกิดฝนตกขึ้นจะทำให้ผ้าที่ตากไว้มีค่าความเปียกเพิ่มขึ้นได้

# ถ้าฝนตก (ไม่สนช่วงเวลากลางวัน - กลางคืน)

# สภาพอากาศ	การเปลี่ยนแปลงของค่าความเปียก (ต่อชั่วโมง)
# Rain (R, r)	เพิ่มค่าความเปียก 2.00
# Storm (S, s)	เพิ่มค่าความเปียก 3.00
# และในสถานการณ์ที่มีเหตุฉุกเฉินเกิด Hurricane (H, h) ขึ้น จะทำให้ผ้าที่ตากเอาไว้สูญหายได้

# สภาพอากาศ	การเปลี่ยนแปลงของค่าความเปียก (ต่อชั่วโมง)
# Hurricane (H, h)	ผ้าที่ตากเอาไว้สูญหาย
# หมายเหตุ: ค่าความเปียกจะไม่ต่ำกว่า 0 (แห้ง) หรือมากกว่า 16 (เปียกโฉก) และเมื่อค่าความเปียกถึง 0 จะทำการเก็บผ้าเข้ามาทันทีทำให้ผ้าไม่เปียกฝน หรือโดนผลกระทบจาก Hurricane

# เมื่อพิจารณาสภาพอากาศรายชั่วโมงเสร็จแล้ว
# ถ้าผ้าแห้งให้ปริ้น: "Dry"
# ถ้าผ้ายังไม่แห้งให้ปริ้น: "Still Wet (Wet Level: wet)"
# และถ้าผ้าสูญหายให้ปริ้น: "Lost"

# wet คือค่าความเปียกเป็นทศนิยม 2 ตำแหน่ง


# Input Specification
# 2 บรรทัด:
# บรรทัดที่ 1: เวลาที่เริ่มตาก (เป็นจำนวนเต็ม)
# บรรทัดที่ 2: สภาพอากาศรายชั่วโมงของการตากผ้า (ประกอบด้วยตัวอักษรที่สื่อถึงสภาพอากาศเท่านั้น*)

# *ตัวอักษรที่สื่อถึงสภาพอากาศนั้นๆ เช่น Cloudy คือ C หรือ c

# Output Specification
# 2 บรรทัด:
# ถ้าผ้าแห้ง:
# บรรทัดที่ 1: "Dry"

# ถ้าผ้ายังไม่แห้ง:
# บรรทัดที่ 1: "Still Wet (Wet Level: wet)"

# ถ้าผ้าสูญหาย:
# บรรทัดที่ 1: "Lost"

# wet คือค่าความเปียกเป็นทศนิยม 2 ตำแหน่ง