# #Bug in the Cage

# *Restrict Word: sort sorted sum {} list append [] join remove dict set pop split tuple lambda match case
# ในช่วงออนไลน์ที่ผ่านมา น้องๆคงจะได้เจอกับโจทย์ข้อ Cage For Pet , Now put the pet into the Cage , Johnny's cage และ More Cage ของพี่ครูสกันได้ไหมครับ ทุกข้อนั้นล้วนแล้วเกี่ยวกับนำสัตว์ประเภทต่างๆมาใส่กรงทั้งนั้นเลยยย แต่อยู่มาวันหนึ่งกรงที่ใช้โชว์สัตว์เลี้ยงก็ถูกรุกราน โดยแมลงประหลาดที่ไม่ทราบที่มา ซึ่งแน่นอนว่าต้องเป็นหน้าที่ของน้องที่จะต้องเข้าไปจัดการกับแมลงเหล่านี้ โดยน้องจะต้องทำการไปยืนอยู่ที่ประตูฝั่งขวาของกรง ที่เปิดแง้มอยู่ / จากนั้นก็ใช้ปืนใหญ่นีโออาร์มสตรอง ไซโคลนเจ็ทอาร์มสตรอง ที่มีระยะการยิงอยู่ที่ x ช่อง และกระสุนอยู่ทั้งหมด y นัด ทำการกำจัดแมลงที่เข้ามารุกราน ( * ) ให้หมดไปปป!!!

# อธิบายตัวอย่างที่ 1
# 5
# 3
# ----------
# |  *  * */
# ----------
# จากตัวอย่างจะกล่าวได้ว่า ปืนใหญ่นีโออาร์มสตรอง ไซโคลนเจ็ทอาร์มสตรอง ของน้องมีระยะการยิง 5 ช่อง และมีกระสุน 3 นัด และในกรงมีแมลงอยู่ 3 ตัว ซึ่งจะได้ Output ดังนี้
# There are still 1 bugs and 1 ammos left.
# ----------
# |  *     /
# ----------
# สาเหตุที่ Output ออกมาดังนี้ เพราะ ปืนมีระยะการยิงที่ 5 ช่อง ทำให้แมลงตัวที่ 3 ที่อยู่ห่างจากประตูทางฝั่งขวาของกรงเป็นระยะ 6 ช่อง ยังมีชีวิตรอดอยู่ เนื่องจาก อยู่เลยระยะของปืนนั่นเอง ทำให้สามารถใช้กระสุน 2 นัดแรก กำจัดแมลงได้เพียงสองตัวเท่านั้น (กระสุน 1 นัด ต่อ 1 ตัว)

# Input Specification
# 5 บรรทัด

# ระยะการยิงของปืน (x) เป็นจำนวนเต็มบวก หรือ ศูนย์
# จำนวนกระสุนที่มี (y) เป็นจำนวนเต็มบวก หรือ ศูนย์
# ส่วนด้านบนของกรง เป็นสตริง ที่ประกอบด้วย - เท่านั้น
# ส่วนพื้นที่ด้านในของกรง ซึ่งอาจจะมีแมลงอยู่ หรือไม่มีก็ได้ ทางด้านซ้ายสุด จะเป็นขอบของกรง | ส่วนทางด้านขวาสุดจะเป็นประตูที่เปิดแง้มอยู่ /
# ส่วนด้านล่างของกรง เป็นสตริง ที่ประกอบด้วย - เท่านั้น
# Output Specification
# 4 บรรทัด
# บรรทัดที่ 1 All bugs are gone, Ahahahahaah. ถ้าหากไม่มีแมลงเหลืออยู่ในกรงเลย

# หรือ

# There are still {จำนวนแมลงที่เหลืออยู่} bugs and {จำนวนกระสุนที่เหลืออยู่} ammos left. ถ้าหากยังมีแมลงหลงเหลืออยู่ในกรง

# บรรทัดที่ 2 ถึง 4 เป็นภาพของกรงหลังจากที่กำจัดแมลงไปแล้ว

# =========