# (Tee) Don't Plus!!!
# 100 + 900 Points
# Unlimited Submission
# 63 Attempt
# 56 Passed
# Time Remaining
# 0d 1h 25m 4s 500ms
# Restrict Word: +
# คุณฉงนต้องการโปรแกรมที่ไว้หาค่าเฉลี่ยของเลขชุดนึง โดยที่คุณฉงนจะกรอกเลขของชุดตัวเลขที่ต้องการหาค่าเฉลี่ยมาทีละตัว และเมื่อกรอกครบ ก็ต้องการให้น้องแสดงผลรวม และค่าเฉลี่ยของเลขชุดนั้นออกมา

# แต่!!!!!
# ครั้งนี้คุณฉงนเกิดไม่ชอบเครื่องหมายบวกขึ้นมานี่สิ จึงไม่ต้องการให้มีเครื่องหมายบวกในโปรแกรมนี้เลยแม้แต่ตัวเดียว

# Tips
# ถึงเราจะใช้เครื่องหมายบวกไม่ได้ แต่เราก็มี build-in function ที่สามารถให้หาค่าผลรวมของ list และมี build-in function ที่ใช้หาค่าจำนวนสมาชิกของ list อยู่ลองหามาใช้ดูนะครับ :)
# https://www.w3schools.com/python/python_ref_functions.asp

# Input Specification
# n+1 บรรทัด

# loop รับค่าตัวเลข จนกว่าจะรับค่า -1
# ตัวเลขที่คุณฉงนกรอก(จำนวนเต็มบวก และ จำนวนเต็มศูนย์)
# ค่า -1ที่รับมาเพื่อหยุดloop
# Output Specification
# 2 บรรทัด

# ค่าผลรวมของชุดตัวเลขที่คุณฉงนกรอก "Total : {ผลรวม}" (จำนวนเต็ม)
# ค่าเฉลี่ยของชุดตัวเลขที่คุณฉงนกรอก "Average : {ค่าเฉลี่ย}" (ทศนิยม 2 ตำแหน่ง)