# ให้รับค่า string ที่ที่มีหลายคำโดยถูกแบ่งโดยช่องว่างแล้วให้แสดง string ใหม่ที่เปลี่ยนคำต่างๆใน string ที่รับค่ามาโดยถ้าตัวอักษรแรกในคำเป็นตัวพิมพ์ใหญ่แล้วที่เหลือเป็นตัวพิมพ์เล็กให้เปลี่ยนคำนั้นให้เป็นตัวพิมพ์ใหญ่ทั้งหมดถ้าเป็นกรณีอื่นให้สลับตัวพิมพ์เล็กกับพิมพ์ใหญ่ของคำนั้น
# ถ้าคำนั้นมีตัวอักษรตัวเดียวก็ไม่ต้องทำอะไร

# Input Specification
# 1 บรรทัด
# บรรทัดที่ 1 : string ที่ถูกแบ่งด้วยช่องว่าง

# Output Specification
# 1 บรรทัด
# บรรทัดที่ 1 : string ที่ถูกเปลี่ยนแล้ว

# Input
# Hello TeSt tEst

# Expected Output
# HELLO tEsT TeST