# #Locked door puzzle

# *Restrict Word: sort sorted sum {} list append [] join remove dict set pop split tuple lambda match case
# Resident Evil 7: Biohazard เป็นเกมไขปริศนาไวรัสพันธุ์สยองพร้อมกับบรรยากาศหลอน ๆ แบบดั้งเดิมของซีรีย์ Resident Evil ซึ่งสิ่งที่พระเอกของเรื่อง หรือ Ethan Winter จะต้องเจอในเนื้อเรื่องนั่นก็คือ การแก้ปริศนาต่างๆในเกม หรือ ที่เราเรียกกันว่า Puzzle ไม่ว่าจะเป็นการหารหัสปลดล็อกประตู การหมุนรูปภาพต่างๆให้ตรงกับรูปแบบของมัน หรือ แม้แต่การหมุนสิ่งของให้ได้เงาที่ตรงกับที่ต้องการ บอกเลยว่าน้องๆที่ชอบการแก้ Puzzle น่าจะชอบเป็นพิเศษครับ โดยในวันนี้เราจะมาช่วยคุณ Ethan Winter ในการแก้ปริศนาปลดล็อกประตู หรือว่า Locked Door Puzzle นั่นเอง โดยที่มีรูปจากในเกมมาให้ดู


# จากในรูปจะเป็นตัวล็อกประตูที่ต้องมีการหมุนตัวอักษรให้ถูกต้อง จึงจะสามารถปลดล็อกได้ (ตัวอักษรในล็อกจะมี 26 ตัว คือ A-Z) โดยการหมุนตัวอักษรก็จะมีทั้งการหมุนขึ้นและหมุนลง ยกตัวอย่างเช่น ถ้าพี่หมุนตัวอักษร A ขึ้น 1 ครั้ง ก็จะได้เป็น B หรือ ถ้าพี่หมุนตัวอักษร A ลง 1 ครั้ง ก็จะได้เป็น Z

# ซึ่งงานของน้อง คือ การหาจำนวนครั้งที่น้อยที่สุดในการที่จะหมุนตัวอักษรแต่ละตัวให้เป็นเหมือนรหัสปลดล็อกที่ถูกต้อง แต่ว่า ในแต่ละรอบของการแก้ puzzle นี้จะมีเวลาจำกัดอยู่ ซึ่งในการหมุนตัวอักษรแต่ละครั้งจะใช้เวลา 1 วินาที เราจึงจำเป็นที่จะต้องหาว่าเราต้องหมุนตัวอักษรน้อยที่สุดกี่ครั้ง จึงจะสามารถแก้ Puzzle นี้ให้ทันเวลาได้ โดยจะเริ่มต้องหมุนตัวอักษรจากทางซ้ายไปทางขวา


# หมายเหตุ: เป็นคลิปจากตัวเกม Resident Evil 7: Biohazard เพื่อให้เห็นภาพมากขึ้น ซึ่งในคลิปตัวอักษรอาจจะไม่ได้เรียงจาก A-Z แต่ในข้อนี้ให้ถือว่าตัวอักษรใน Locked เรียงจาก A-Z

# Input Specification
# 3 บรรทัด

# ลำดับของตัวอักษรในตอนแรกของ Locked เป็นสตริง ความยาวมากกว่า หรือ เท่ากับ 1
# รหัสที่ถูกต้องในการใช้ปลดล็อกรหัส ความยาวเท่ากับสตริงในบรรทัดแรก
# เวลาในการแก้ Puzzle นี้ ในรูปแบบ "{MM}:{SS}"
# Output Specification
# 2 บรรทัด
# มี 2 กรณี

# หากสามารถแก้ Puzzle ได้ก่อนหมดเวลา หรือ ทันเวลาพอดีเป๊ะ ให้ตอบว่า
# บรรทัดที่ 1 แสดงจำนวนครั้งที่น้อยที่สุดในการหมุน (เป็นจำนวนเต็ม)
# บรรทัดที่ 2 แสดงเวลาที่เหลือ ในรูปแบบ "{MM}:{SS}"
# หากไม่สามารถแก้ Puzzle ได้ก่อนหมดเวลา ให้ตอบว่า
# บรรทัดที่ 1 "You don't make it in time!!!"
# บรรทัดที่ 2 แสดงลำดับของตัวอักษรในล็อก ที่ถูกหมุนไปได้ใกล้เคียงกับ รหัสที่ถูกต้องมากที่สุด (พิจารณาว่าควรต้องหมุนขึ้น หรือ หมุนลง เพื่อให้ตัวอักษรใกล้เคียงกับรหัสที่ถูกต้อง)