# (Tee) Sorry
# 100 + 900 Points
# Unlimited Submission
# 51 Attempt
# 43 Passed
# Time Remaining
# 0d 1h 24m 33s 761ms
# พี่กับพี่ข้าวกำลังจะไปซื้อของกัน พี่ข้าวก็เลยให้พี่ช่วยจดรายการสิ่งของที่จะต้องซื้อไว้ แต่ด้วยความที่พี่ข้าวนอนน้อยจึงเบลอๆไปบ้าง อาจจะพูดรายการสินค้าผิด พี่ข้าวก็จะพูด"Sorry"เพื่อให้พี่ลบชื่อสินค้าชิ้นล่าสุดออก ก่อนที่จะจดรายการต่อไป พี่จึงอยากให้น้องช่วยเขียนโปรแกรมเพื่อหารายการสินค้าที่พี่ต้องซื้อจากสิ่งที่พี่ข้าวพูดให้หน่อย

# Input Specification
# n+1 บรรทัด

# loopรับค่าสิ่งที่พี่ข้าวพูด จนกว่าจะเจอคำว่า "End"
# ชื่อสินค้าที่ต้องซื้อ หรือ "Sorry"
# "End"
# Output Specification
# 1 บรรทัด
# รายการสินค้าที่ต้องซื้อ โดยระหว่างชื่อสินค้าแต่ละชิ้นจะคั่นด้วย ", "

# หมายเหตุ
# 1.ในการเรียงลำดับสามารถเรียงลำดับตามสิ่งที่รับเข้ามาก่อน-หลังได้เลย
# 2.มั่นใจได้ว่าพี่กับพี่ข้าวจะต้องซื้อของแน่ๆอย่างน้อย 1 ชิ้น