# ในวันหนึ่งช่วงกลางวันในช่วงเวลาเรียนของ พี่ธี กับ พี่เท็น นั้นอยู่ๆ พี่ธี กับ พี่เท็น ก็รู้กำลังรู้สึกเบื่อมาก ๆ จึงคิดว่า อยากทำอะไรเล่นเกม สนุก ๆ แก้เบื้อ จึง ถามพี่ข้าว ให้ช่วยคิดเกมให้หน่อย พี่ข้าวรู้สึกว่า พี่ธี กับพี่เท็น เล่นกันเหมือนเด็ก 3 ขวบ จึงนึกถึง การเล่น tic tac toe หรือ "โอ เอ็ก" นั้นเอง ครับ แต่ เนื่องจาก พี่ข้าวนั้นฝึกทำอาหารเพื่อ จะเป็นเชฟอันดับหนึงของโลก จึงทำให้เขียนไม่เป็นแล้ว พี่ข้าวจึงมาขอร้องให้น้องๆ ช่วย ทำเกม Tic Tac Toe ให้ พี่ข้าวหน่อย
# โดยโปรแกรม จะรับค่าเข้าเป็น ข้อความที่เป็น list[]

# ตัวอยากเช่น
# [[" ","X","O"],["O","X"," "],[" ","X"," "]]
# [[" ","O","X"],["X","O"," "],[" ","O"," "]]
# โดยข้อความใน list สามารถเป็นได้ทั้งตัวอักษร(alphabet) หรือ ช่องว่าง(" ") โดยโปรแกรม จะสนใจ แค่ ค่า 'X' หรือ 'O' เท่า นั้น
# โดยกฏในการชนะมีอยู่ว่า ถ้าในแนวนอน หรือ แนวตั้ง หรือ แนวแทยง มีตัว อักษรเดียวกันเรียงกัน ได้ 3 ตัว ก็ จะถือว่า ชนะ และให้แสดงผลผ่าย X หรือ O ชนะ เช่น
# "X player won, haha Ez!!"
# "O player won, haha Ez!!"
# และมีเงื่อนไขเพิ่มเติมว่า

# ถ้าชนะโดยเป็นการทำคะแนนจากแถวที่1 แนวนอน ให้แสดงผล

# "first horizon row"
# ถ้าชนะโดยเป็นการทำคะแนนจากแถวที่2 ให้แสดงผล

# "second horizon row"
# ถ้าชนะโดยเป็นการทำคะแนนจากแถวที่3 แนวนอน ให้แสดงผล

# "third horizon row"
# ถ้าชนะโดยเป็นการทำคะแนนจากแถวที่1 แนวตั้ง ให้แสดงผล

# "first vertical row"
# ถ้าชนะโดยเป็นการทำคะแนนจากแถวที่2 แนวตั้ง ให้แสดงผล

# "second vertical row"
# ถ้าชนะโดยเป็นการทำคะแนนจากแถวที่3 แนวตั้ง ให้แสดงผล

# "third vertical row"
# ถ้าชนะโดยเป็นการทำคะแนนโดยใช้แนวแทยงมุม จากซ้ายบนมาขวาล่าง ให้แสดงผล

# "first diagonal row"
# ถ้าชนะโดยเป็นการทำคะแนนโดยใช้แนวแทยงมุม จากขวาบนมาซ้ายล่าง ให้แสดงผล

# "second diagonal row"
# แต่ถ้าหากไม่มีใครชนะเลย ให้แสดงผลคำว่า "Haha Draw, 15FF"

# 𝑇
# 𝑖
# 𝑝
# 𝑠
# 𝑇
# 𝑟
# 𝑖
# 𝑐
# 𝐾
# TipsTricK

# ถ้าเราเอา list ใน list เรียงรูปแบบใหม่สามารถ มองได้ว่ามันคือ Matrix นั้นเองครับ หรือจะมองเป็น ตารางก็ได้ครับ

# เช่น [[" ","X","O"],["O","X"," "],[" ","X"," "]]

# มองได้ว่าก็คือ
# [[" ","X","O"], << แถวที่ 1
# ["O","X"," "], << แถวที่ 2
# [" ","X"," "]] << แถวที่ 3
# NOTES >>>>>>>>>>>>>>> สำคัญมากกกกกกกก <<<<<<<<<<<<<<<<<

# ข้อนี้ ให้ลองศึกษา โมดูล json และการใช้งาน json.loads() มาปรับใช้ดูครับ
# Input Specification
# ทั้งหมด 1 บรรทัด
# บรรทัดที่ 1 : ข้อความที่เป็น list[] ของเกม Tic Tac Toe
# เช่น : [[" ","X","O"],["O","X"," "],[" ","X"," "]]
# Output Specification
# ทั้งหมด 2 บรรทัด
# หากมีใครเข้าเงื่อนไขชนะ
# บรรทัดที่ 1 : "{X หรือ O} player won, haha Ez!!"
# บรรทัดที่ 2 : บอกว่าชนะด้วยการทำคะแนนแบบไหน เช่น: "first horizon row"
# หากไม่มีใครชนะเลย
# บรรทัดที่ 1 : "Haha Draw, 15FF"

# Input
# [["O"," ","X"],["O"," ","X"],[" "," ","X"]]

# Expected Output
# X player won, haha Ez!!
# third vertical row


# Input
# [["X","O"," "],["X","O"," "],[" ","O","X"]]

# Expected Output
# O player won, haha Ez!!
# second vertical row

# Input
# [["X","O "," "],["O","X"," "],[" ","O","X"]]

# Expected Output
# X player won, haha Ez!!
# first diagonal row